/*
Зробити обєкт Користувач (Ім'я, пошта, пароль, телефон, баласн з коштами)


В користувача має бути функціонал:
	Реєстрація (Користувач вводить всі значення, пароль двічі з перевіркою)
	Логін (Вводить пошту і пароль, якщо правильна то його відкривається меню користувача)
	Поповнення балансу (Використовувати інкапсуляцію)
	Покупка товарів (Користувач може бачити список товарів які він може купити і за яку ціну) <---- перевірки чи хватає грошей та чи є продукт в наявності

Також у вас є бути файл який буде названий config.txt в якому буде збережений логін і пароль для адміна

Приклад:
Admin
1234

Зробити обєкт Продукт (Назва, Ціна, Опис, Кількість)

Якщо при логіні був введений такий пароль як у файлі, відкривається меню адміна де є керування всіма продуктами
(Додавання, Пошук, Видалення, *Редуагування) <---- всі продукти мають бути збережені у файлі
Також адмін може змінювати собі пароль)

*/
#include "Database.h"

int main()
{
	Database data;
	data.Enter();

	return 0;
}